cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'kaos/shell'
tap 'getantibody/tap'

brew 'coreutils'
brew 'zsh'
brew 'mas'
brew 'antibody'
brew 'fasd'
brew 'direnv'

brew 'wget'

# nodejs
brew 'node'

# golang
brew 'go'

# kubernetes
brew 'kubectx' # fast switching between clusters

# casks
cask 'google-chrome'
cask 'atom'
cask 'visual-studio-code'
cask 'spectacle'
cask 'postgres'

cask 'iterm2'
